In [24]:
import sys
sys.path.append('..')

from PCA_data_menager import PCADataMenager

read from csv

In [25]:
data_frame = PCADataMenager()
data_frame.read_from_csv('username.csv')
data_frame.display()

    Username  Identifier First name Last name
0   booker12        9012     Rachel    Booker
1     grey07        2070      Laura      Grey
2  johnson81        4081      Craig   Johnson
3  jenkins46        9346       Mary   Jenkins
4    smith79        5079      Jamie     Smith

types

In [26]:
data_frame.get_variable_types()

Username      object
Identifier     int64
First name    object
Last name     object
dtype: object

normalzation

In [27]:
data_frame.normalize_std('Identifier')
data_frame.display()

    Username  Identifier First name Last name
0   booker12    0.975981     Rachel    Booker
1     grey07   -1.213542      Laura      Grey
2  johnson81   -0.579268      Craig   Johnson
3  jenkins46    1.081326       Mary   Jenkins
4    smith79   -0.264496      Jamie     Smith

In [28]:
data_frame.reset()
data_frame.normalize_q('Identifier')
data_frame.display()

    Username  Identifier First name Last name
0   booker12    1.000000     Rachel    Booker
1     grey07   -0.407828      Laura      Grey
2  johnson81    0.000000      Craig   Johnson
3  jenkins46    1.067735       Mary   Jenkins
4    smith79    0.202393      Jamie     Smith

variable changle name

In [29]:
data_frame.rename_variable("Identifier", "ID")
data_frame.rename_variable("Last name", "Surname")
data_frame.display()

    Username        ID First name  Surname
0   booker12  1.000000     Rachel   Booker
1     grey07 -0.407828      Laura     Grey
2  johnson81  0.000000      Craig  Johnson
3  jenkins46  1.067735       Mary  Jenkins
4    smith79  0.202393      Jamie    Smith

In [30]:
data_frame.rename_variable("Identifier", "ID")
data_frame.rename_variable("Identifieraki", "ID")
data_frame.get_variable_types()

Username       object
ID            float64
First name     object
Surname        object
dtype: object

In [31]:
data_frame.one_hot_encode("First name")
data_frame.display()

,Username,ID,Surname,First name_Craig,First name_Jamie,First name_Laura,First name_Mary,First name_Rachel
0,booker12,1.000000,Booker,0,0,0,0,1
1,grey07,-0.407828,Grey,0,0,1,0,0
2,johnson81,0.000000,Johnson,1,0,0,0,0
3,jenkins46,1.067735,Jenkins,0,0,0,1,0
4,smith79,0.202393,Smith,0,1,0,0,0

In [32]:
data_frame.normalize_std('First name_Laura')
data_frame.display()

,Username,ID,Surname,First name_Craig,First name_Jamie,First name_Laura,First name_Mary,First name_Rachel
0,booker12,1.000000,Booker,0,0,-0.447214,0,1
1,grey07,-0.407828,Grey,0,0,1.788854,0,0
2,johnson81,0.000000,Johnson,1,0,-0.447214,0,0
3,jenkins46,1.067735,Jenkins,0,0,-0.447214,1,0
4,smith79,0.202393,Smith,0,1,-0.447214,0,0